app/views/students/new.html.erb

SELECT "schools".* FROM "schools"
---
<br>
 <%= f.collection_select :school_id, School.all, :id, :name, prompt: true %>