app/views/schools/show.html.erb

<h3> Students: </h3>
<% @school.students.each do |student|%>
---
SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 4]]