app/controllers/students_controller.rb

INSERT INTO "students" ("name", "age", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "gdfgd"], ["age", 3], ["school_id", 2], ["created_at", "2019-11-05 18:24:58.623317"], ["updated_at", "2019-11-05 18:24:58.623317"]]
---
  def create
    @student = Student.create(student_params)